examples/tobias_tutorial/dakota_geometric_variation/templates/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  www.openfoam.org                      |
|   \\  /    A nd           | Version:  12                                    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//- Optimization parameter
//  Inlet position set by dakota. Dakota will give a new length. Therefore,
//  the new x positions are length/2 +- centre x coordinate (changed within
//  dakota.sh) - Do not change the line position of the next two entries.

x1 .028617;
x2 .041383;

convertToMeters 1;

vertices
(
    (0     0     0)         //  0
    (0     0.03  0)         //  1
    (0.03  0     0)         //  2
    (0.03  0.03  0)         //  3
    (0.04  0     0)         //  4
    (0.04  0.03  0)         //  5
    (0.1   0     0)         //  6
    (0.1   0.03  0)         //  7
    (0.14  0.04  0)         //  8
    (0.11  0.04  0)         //  9
    (0.14  0.14  0)         // 10
    (0.11  0.14  0)         // 11

    (0     0     0.005)     // 12
    (0     0.03  0.005)     // 13
    (0.03  0     0.005)     // 14
    (0.03  0.03  0.005)     // 15
    (0.04  0     0.005)     // 16
    (0.04  0.03  0.005)     // 17
    (0.1   0     0.005)     // 18
    (0.1   0.03  0.005)     // 19
    (0.14  0.04  0.005)     // 20
    (0.11  0.04  0.005)     // 21
    (0.14  0.14  0.005)     // 22
    (0.11  0.14  0.005)     // 23

    //- Inlet points
    //  x-position manipulated by dakota
    ($x1 -0.05 0)         // 24
    ($x2 -0.05 0)         // 25
    ($x1 -0.05 0.005)     // 26
    ($x2 -0.05 0.005)     // 27
    
);

blocks
(
    hex (0 2 3 1 12 14 15 13) (20 20 1) simpleGrading (0.5 1 1)
    hex (2 4 5 3 14 16 17 15) (10  20 1) simpleGrading (1 1 1)
    hex (4 6 7 5 16 18 19 17) (60 20 1) simpleGrading (1 1 1)
    hex (6 8 9 7 18 20 21 19) (30 20 1) simpleGrading (1 1 1)
    hex (8 10 11 9 20 22 23 21) (80 20 1) simpleGrading (1 1 1)
    hex (24 25 4 2 26 27 16 14) (10 30 1) simpleGrading (1 1 1)
);

edges
(
    arc 7 9 (0.1070710678 0.0329289322 0.00)
    arc 19 21 (0.1070710678 0.0329289322 0.005)

    arc 6 8 (0.1279978822 0.0120021178 0)
    arc 18 20 (0.1279978822 0.0120021178 0.005)
);

boundary
(

    front
    {
        type patch;
        faces
        (
            (0 2 3 1)
            (2 4 5 3)
            (4 6 7 5)
            (6 8 9 7)
            (8 10 11 9)
            (24 25 4 2)
        );
    }

    back 
    {
        type patch;
        faces
        (
            (12 13 15 14)
            (14 16 17 15)
            (16 18 19 17)
            (18 20 21 19)
            (20 22 23 21)
            (26 27 16 14)
        );
    }

    inletHot
    {
        type patch;
        faces
        (
            (0 1 13 12)
        );
    }

    inletCold
    {
        type patch;
        faces
        (
            (24 25 27 26)
        );
    }

    outlet 
    {
        type patch;
        faces
        (
            (10 11 23 22)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (0 2 14 12)
            (13 15 3 1)
            (3 5 17 15)
            (5 7 19 17)
            (4 6 18 16)
            (6 8 20 18)
            (7 9 21 19)
            (8 10 22 20)
            (9 11 23 21)
            (24 26 14 2)
            (25 27 16 4)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
